AuditLogs
| where ActivityDisplayName contains "Add Member to group"
| where TimeGenerated >= datetime(2022-08-29 06:00:00Z)
| extend userPrincipalName_ = tostring(TargetResources[0].userPrincipalName)
| extend LogicApp = tostring(parse_json(tostring(InitiatedBy.app)).displayName)
| where LogicApp endswith "_ManagedGroupsForCARollOut"
| project LogicApp, userPrincipalName_
| summarize NewMembers = count() //by LogicApp 
//| sort by LogicApp

